{
  "_class_name": "AutoencoderKL",
  "_diffusers_version": "0.27.2",
  "_name_or_path": "/home/stef/.cache/huggingface/hub/models--hf-internal-testing--tiny-stable-diffusion-torch/snapshots/a88cdfbd91f96ec7f61eb7484b652ff0f4ee701d/vae",
  "act_fn": "silu",
  "block_out_channels": [
    32,
    64
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "force_upcast": true,
  "in_channels": 3,
  "latent_channels": 4,
  "latents_mean": null,
  "latents_std": null,
  "layers_per_block": 1,
  "norm_num_groups": 32,
  "out_channels": 3,
  "sample_size": 128,
  "scaling_factor": 0.18215,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ]
}
